1811htsang/uEDP/sources/pal/arch/stm32_f103/stm32_f103_arch.c
/**
 * @file stm32_arch.c
 * @author Shang Huang
 * @brief Implementation of STM32 Architecture Abstraction Layer for UEDP
 * @version 0.1
 * @date 2026-04-20
 * @copyright MIT License
 */

/**
 * @brief Khai báo thư viện sử dụng
 */

#include <stdint.h>
#include "stm32_f103_arch.h"
#include "uedp_core.h"
#include "uedp_task.h"
#include "uedp_msg.h"
#include "uedp_timer.h"
#include "pal_memrp.h"

/**
 * @brief Khai báo biến kiểm tra đã khởi tạo hay chưa
 */

static ui8 is_inited = 0x0u;

/**
 * @brief Đảm bảo uedp_timer_tick được biết đến
 */

extern void uedp_timer_tick(void);

/**
 * @brief Khai báo hàm nội bộ 
 */

static void internal_hardfault_decoder(uint32_t *stack);

/**
 * @brief Typedef của RTC dành cho việc xử lý lỗi fatal
 */

// Điền các khai báo tại đây

/**
 * @brief Định nghĩa các biểu tượng linker script để quản lý bộ nhớ
 * @note Các khai báo này phụ thuộc vào cấu hình của STM32 và linker script được sử dụng trong dự án.
 */

extern ui32 _etext;            /* End của code section (.text) 				    */
extern ui32 _sidata;           /* Start của initialized data trong FLASH 	*/
extern ui32 _sdata, _edata;    /* RAM initialized data 						        */
extern ui32 _sbss, _ebss;      /* RAM zero-init data 							        */
extern ui32 _estack;           /* Top of Stack 										        */
extern ui32 _end;              /* Start of Heap (thường sau bss) 	        */

/**
 * @brief Định nghĩa địa chỉ bắt đầu của FLASH để tính toán bộ nhớ đã sử dụng
 */

#define FLASH_START 0x08000000  /* STM32F1 FLASH Start Address */

/**
 * @brief Định nghĩa hàm nội bộ
 * @attention Do hàm gọi trong asm của HardFault_Handler nên bổ sung thuộc tính unused 
 *            để tránh cảnh báo từ compiler về việc không sử dụng hàm này trong code C thông thường
 */

UEDP_ATTR_UNUSED void internal_hardfault_decoder(uint32_t *stack) {
  
}

/**
 * @brief Implementation cho uedp_core.h
 */

void uedp_core_init(void) {
  pal_core_init();
  uedp_msg_pool_init();
  uedp_timer_init();
  is_inited = 0x1u;
}

/**
 * @brief Implementation cho pal_core.h
 */

void pal_core_init(void) {
  pal_stm32_init_env();
}

void pal_enter_critical(void) {
  
}

void pal_exit_critical(void) {
  
}

ui8 pal_math_get_highest_bit32(ui32 mask) {
  
}

ui32 pal_sys_get_tick(void) {
  
}

void pal_sys_reset(void) {
	
}

void pal_sys_fatal(const char* file, ui32 line, const char* msg) {
	
}

/**
 * @brief Implementation cho stm32_arch.h
 * @note Việc bổ sung các triển khai
 *       tùy thuộc vào nhu cầu riêng của từng dự án, 
 *       có thể là khởi tạo clock, GPIO, UART, v.v.
 * @note Gọi hàm này để đảm bảo các biểu tượng linker script 
 *       được sử dụng và không bị tối ưu hóa mất
 */

void pal_stm32_init_env(void) {
  pal_memrp_get_sys_info(NULL, NULL, NULL);
  pal_stm32_nvic_config();
}

void pal_stm32_idle_sleep(void) {
	
}

void pal_stm32_nvic_config(void) {

}

void pal_stm32_exti_init(ui32 IRQnum) {
  
}

void pal_stm32_check_hardfault_reason(char* retr) {
  
}

void pal_memrp_get_sys_info(ui32 *rom_used, ui32 *ram_used, ui32 *stack_curr) {
  
}

void SysTick_Handler(void) {
	
}

__attribute__((naked)) void HardFault_Handler(void) {
  
}


